API/Tests/FlightReservation/Result10/Report/Data/Step12.xml

<?xml-stylesheet href="..//StServiceCallActivity.xsl" type="text/xsl"?><report><VTD_Type name="Type">HP.ST.Ext.WebServicesActivities.StServiceCallActivity</VTD_Type><VTD_Name name="Step ID">StServiceCallActivity9</VTD_Name><InputXml name="InputXml" xml="True" link="True" FileLocation="StServiceCallActivity9_InputXml_5038be23-d81d-44a6-99a9-3d150ca7f815.xml">&lt;Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance"&gt;
  &lt;Body&gt;
    &lt;UpdateFlightOrder xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;UpdateFlightOrderDetails&gt;
        &lt;Class&gt;Business&lt;/Class&gt;
        &lt;CustomerName&gt;Dhanya Rakesh&lt;/CustomerName&gt;
        &lt;NumberOfTickets&gt;3&lt;/NumberOfTickets&gt;
        &lt;OrderNumber&gt;100&lt;/OrderNumber&gt;
      &lt;/UpdateFlightOrderDetails&gt;
    &lt;/UpdateFlightOrder&gt;
  &lt;/Body&gt;
&lt;/Envelope&gt;</InputXml><Service name="Service">Flights_Service</Service><Port name="Port">FlightsServiceMethods</Port><Operation name="Operation">UpdateFlightOrder</Operation><Address name="Address">http://localhost:8000/Flights_SOAP</Address><SOAPAction name="SOAPAction">HP.SOAQ.SampleApp/IFlightsSoapService/UpdateFlightOrder</SOAPAction><ContentType name="ContentType">text/xml; charset=utf-8</ContentType><MessageExchangePattern name="MessageExchangePattern">Request Response</MessageExchangePattern><Full_request name="Full request" TooLong="True" link="True" FileLocation="StServiceCallActivity9_Full_request_28364fc8-0035-467c-b58a-1dac88700559.xml">&lt;?xml version="1.0"? ... &lt;/Body&gt;
&lt;/Envelope&gt;</Full_request><InputHeader name="InputHeader">SOAPAction:	HP.SOAQ.SampleApp/IFlightsSoapService/UpdateFlightOrder
Content-Type:	text/xml; charset=utf-8
Host:	localhost:8000
Content-Length:	386
Connection:	Close
</InputHeader><OutputHeader name="OutputHeader">Connection:	close
Content-Length:	230
Content-Type:	text/xml; charset=utf-8
Date:	Mon, 06 Jan 2025 11:39:10 GMT
Server:	Microsoft-HTTPAPI/2.0
</OutputHeader><OutputText name="OutputText">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;&lt;s:Body&gt;&lt;UpdateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;&lt;UpdateFlightOrderResult&gt;true&lt;/UpdateFlightOrderResult&gt;&lt;/UpdateFlightOrderResponse&gt;&lt;/s:Body&gt;&lt;/s:Envelope&gt;</OutputText><HttpStatusCode name="HttpStatusCode">200 : OK</HttpStatusCode><OutputXml name="OutputXml" xml="True" link="True" FileLocation="StServiceCallActivity9_OutputXml_88a77bf9-b3f1-4ebb-99e8-574e778064b1.xml">&lt;s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"&gt;
  &lt;s:Body&gt;
    &lt;UpdateFlightOrderResponse xmlns="HP.SOAQ.SampleApp"&gt;
      &lt;UpdateFlightOrderResult&gt;true&lt;/UpdateFlightOrderResult&gt;
    &lt;/UpdateFlightOrderResponse&gt;
  &lt;/s:Body&gt;
&lt;/s:Envelope&gt;</OutputXml><VTD_Message name="Message">Web service call performed successfully</VTD_Message><Name name="Name">'UpdateFlightOrder'</Name><Comment name="Comment">''</Comment><VTD_Status name="Status">Done</VTD_Status></report>